# Taps
tap "heroku/brew"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "ngrok/ngrok"

# CLI essentials
brew "bat"           # better cat
brew "bottom"        # better top/htop
brew "eza"           # better ls
brew "fastfetch"     # system info
brew "fd"            # better find
brew "fzf"           # fuzzy finder
brew "htop"          # process monitor
brew "jq"            # JSON processor
brew "ripgrep"       # better grep
brew "the_silver_searcher" # ag - fast code search
brew "yazi"          # terminal file manager

# Editors
brew "neovim"

# Git
brew "diff-so-fancy"
brew "lazygit"
brew "jesseduffield/lazydocker/lazydocker"

# Ruby
brew "rbenv"
brew "ruby-build"

# Node
# nvm is installed separately via install script

# Cloud & DevOps
brew "flyctl"
brew "heroku/brew/heroku"
brew "kubernetes-cli"
brew "kubectx"

# Docker utilities
brew "docker-compose"

# Network
brew "gnupg"
brew "imagemagick"
brew "ngrep"
brew "ngrok/ngrok/ngrok"

# Database clients
brew "libpq"

# AI tools
brew "aichat"
brew "opencode"

# Languages
brew "python@3.11"

# Fun
brew "cowsay"
brew "fortune"
brew "lolcat"

# Dependencies
brew "openssl@3"
brew "zstd"
brew "libzip"

# Misc
brew "bitwarden-cli"
brew "starship"
brew "worktrunk"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-maple-mono"
cask "font-monaspace"

# Apps
cask "claude"
cask "inkscape"

# Tunneling
cask "ngrok/ngrok/ngrok"
